grevaillot/svd_tools/headers/STM32F429/fmc.h
/** FMC_SR2_FEMPT FEMPT **/
#define FMC_SR2_FEMPT		(1 << 6)
/** FMC_SR2_IFEN IFEN **/
#define FMC_SR2_IFEN		(1 << 5)
/** FMC_SR2_ILEN ILEN **/
#define FMC_SR2_ILEN		(1 << 4)
/** FMC_SR2_IREN IREN **/
#define FMC_SR2_IREN		(1 << 3)
/** FMC_SR2_IFS IFS **/
#define FMC_SR2_IFS		(1 << 2)
/** FMC_SR2_ILS ILS **/
#define FMC_SR2_ILS		(1 << 1)
/** FMC_SR2_IRS IRS **/
#define FMC_SR2_IRS		(1 << 0)

/**@}*/

/** @defgroup fmc_pmem2 PMEM2 Common memory space timing register 2
@{*/


#define FMC_PMEM2_MEMHIZx_SHIFT		24
#define FMC_PMEM2_MEMHIZx_MASK		0xff
/** @defgroup fmc_pmem2_memhizx MEMHIZx MEMHIZx
@{*/
/**@}*/


#define FMC_PMEM2_MEMHOLDx_SHIFT		16
#define FMC_PMEM2_MEMHOLDx_MASK		0xff
/** @defgroup fmc_pmem2_memholdx MEMHOLDx MEMHOLDx
@{*/
/**@}*/


#define FMC_PMEM2_MEMWAITx_SHIFT		8
#define FMC_PMEM2_MEMWAITx_MASK		0xff
/** @defgroup fmc_pmem2_memwaitx MEMWAITx MEMWAITx
@{*/
/**@}*/


#define FMC_PMEM2_MEMSETx_SHIFT		0
#define FMC_PMEM2_MEMSETx_MASK		0xff
/** @defgroup fmc_pmem2_memsetx MEMSETx MEMSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_patt2 PATT2 Attribute memory space timing register 2
@{*/


#define FMC_PATT2_ATTHIZx_SHIFT		24
#define FMC_PATT2_ATTHIZx_MASK		0xff
/** @defgroup fmc_patt2_atthizx ATTHIZx ATTHIZx
@{*/
/**@}*/


#define FMC_PATT2_ATTHOLDx_SHIFT		16
#define FMC_PATT2_ATTHOLDx_MASK		0xff
/** @defgroup fmc_patt2_attholdx ATTHOLDx ATTHOLDx
@{*/
/**@}*/


#define FMC_PATT2_ATTWAITx_SHIFT		8
#define FMC_PATT2_ATTWAITx_MASK		0xff
/** @defgroup fmc_patt2_attwaitx ATTWAITx ATTWAITx
@{*/
/**@}*/


#define FMC_PATT2_ATTSETx_SHIFT		0
#define FMC_PATT2_ATTSETx_MASK		0xff
/** @defgroup fmc_patt2_attsetx ATTSETx ATTSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_eccr2 ECCR2 ECC result register 2
@{*/


#define FMC_ECCR2_ECCx_SHIFT		0
#define FMC_ECCR2_ECCx_MASK		0xffffffff
/** @defgroup fmc_eccr2_eccx ECCx ECCx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_pcr3 PCR3 PC Card/NAND Flash control register 3
@{*/


#define FMC_PCR3_ECCPS_SHIFT		17
#define FMC_PCR3_ECCPS_MASK		0x07
/** @defgroup fmc_pcr3_eccps ECCPS ECCPS
@{*/
/**@}*/


#define FMC_PCR3_TAR_SHIFT		13
#define FMC_PCR3_TAR_MASK		0x0f
/** @defgroup fmc_pcr3_tar TAR TAR
@{*/
/**@}*/


#define FMC_PCR3_TCLR_SHIFT		9
#define FMC_PCR3_TCLR_MASK		0x0f
/** @defgroup fmc_pcr3_tclr TCLR TCLR
@{*/
/**@}*/

/** FMC_PCR3_ECCEN ECCEN **/
#define FMC_PCR3_ECCEN		(1 << 6)

#define FMC_PCR3_PWID_SHIFT		4
#define FMC_PCR3_PWID_MASK		0x03
/** @defgroup fmc_pcr3_pwid PWID PWID
@{*/
/**@}*/

/** FMC_PCR3_PTYP PTYP **/
#define FMC_PCR3_PTYP		(1 << 3)
/** FMC_PCR3_PBKEN PBKEN **/
#define FMC_PCR3_PBKEN		(1 << 2)
/** FMC_PCR3_PWAITEN PWAITEN **/
#define FMC_PCR3_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fmc_sr3 SR3 FIFO status and interrupt register 3
@{*/

/** FMC_SR3_FEMPT FEMPT **/
#define FMC_SR3_FEMPT		(1 << 6)
/** FMC_SR3_IFEN IFEN **/
#define FMC_SR3_IFEN		(1 << 5)
/** FMC_SR3_ILEN ILEN **/
#define FMC_SR3_ILEN		(1 << 4)
/** FMC_SR3_IREN IREN **/
#define FMC_SR3_IREN		(1 << 3)
/** FMC_SR3_IFS IFS **/
#define FMC_SR3_IFS		(1 << 2)
/** FMC_SR3_ILS ILS **/
#define FMC_SR3_ILS		(1 << 1)
/** FMC_SR3_IRS IRS **/
#define FMC_SR3_IRS		(1 << 0)

/**@}*/

/** @defgroup fmc_pmem3 PMEM3 Common memory space timing register 3
@{*/


#define FMC_PMEM3_MEMHIZx_SHIFT		24
#define FMC_PMEM3_MEMHIZx_MASK		0xff
/** @defgroup fmc_pmem3_memhizx MEMHIZx MEMHIZx
@{*/
/**@}*/


#define FMC_PMEM3_MEMHOLDx_SHIFT		16
#define FMC_PMEM3_MEMHOLDx_MASK		0xff
/** @defgroup fmc_pmem3_memholdx MEMHOLDx MEMHOLDx
@{*/
/**@}*/


#define FMC_PMEM3_MEMWAITx_SHIFT		8
#define FMC_PMEM3_MEMWAITx_MASK		0xff
/** @defgroup fmc_pmem3_memwaitx MEMWAITx MEMWAITx
@{*/
/**@}*/


#define FMC_PMEM3_MEMSETx_SHIFT		0
#define FMC_PMEM3_MEMSETx_MASK		0xff
/** @defgroup fmc_pmem3_memsetx MEMSETx MEMSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_patt3 PATT3 Attribute memory space timing register 3
@{*/


#define FMC_PATT3_ATTHIZx_SHIFT		24
#define FMC_PATT3_ATTHIZx_MASK		0xff
/** @defgroup fmc_patt3_atthizx ATTHIZx ATTHIZx
@{*/
/**@}*/


#define FMC_PATT3_ATTHOLDx_SHIFT		16
#define FMC_PATT3_ATTHOLDx_MASK		0xff
/** @defgroup fmc_patt3_attholdx ATTHOLDx ATTHOLDx
@{*/
/**@}*/


#define FMC_PATT3_ATTWAITx_SHIFT		8
#define FMC_PATT3_ATTWAITx_MASK		0xff
/** @defgroup fmc_patt3_attwaitx ATTWAITx ATTWAITx
@{*/
/**@}*/


#define FMC_PATT3_ATTSETx_SHIFT		0
#define FMC_PATT3_ATTSETx_MASK		0xff
/** @defgroup fmc_patt3_attsetx ATTSETx ATTSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_eccr3 ECCR3 ECC result register 3
@{*/


#define FMC_ECCR3_ECCx_SHIFT		0
#define FMC_ECCR3_ECCx_MASK		0xffffffff
/** @defgroup fmc_eccr3_eccx ECCx ECCx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_pcr4 PCR4 PC Card/NAND Flash control register 4
@{*/


#define FMC_PCR4_ECCPS_SHIFT		17
#define FMC_PCR4_ECCPS_MASK		0x07
/** @defgroup fmc_pcr4_eccps ECCPS ECCPS
@{*/
/**@}*/


#define FMC_PCR4_TAR_SHIFT		13
#define FMC_PCR4_TAR_MASK		0x0f
/** @defgroup fmc_pcr4_tar TAR TAR
@{*/
/**@}*/


#define FMC_PCR4_TCLR_SHIFT		9
#define FMC_PCR4_TCLR_MASK		0x0f
/** @defgroup fmc_pcr4_tclr TCLR TCLR
@{*/
/**@}*/

/** FMC_PCR4_ECCEN ECCEN **/
#define FMC_PCR4_ECCEN		(1 << 6)

#define FMC_PCR4_PWID_SHIFT		4
#define FMC_PCR4_PWID_MASK		0x03
/** @defgroup fmc_pcr4_pwid PWID PWID
@{*/
/**@}*/

/** FMC_PCR4_PTYP PTYP **/
#define FMC_PCR4_PTYP		(1 << 3)
/** FMC_PCR4_PBKEN PBKEN **/
#define FMC_PCR4_PBKEN		(1 << 2)
/** FMC_PCR4_PWAITEN PWAITEN **/
#define FMC_PCR4_PWAITEN		(1 << 1)

/**@}*/

/** @defgroup fmc_sr4 SR4 FIFO status and interrupt register 4
@{*/

/** FMC_SR4_FEMPT FEMPT **/
#define FMC_SR4_FEMPT		(1 << 6)
/** FMC_SR4_IFEN IFEN **/
#define FMC_SR4_IFEN		(1 << 5)
/** FMC_SR4_ILEN ILEN **/
#define FMC_SR4_ILEN		(1 << 4)
/** FMC_SR4_IREN IREN **/
#define FMC_SR4_IREN		(1 << 3)
/** FMC_SR4_IFS IFS **/
#define FMC_SR4_IFS		(1 << 2)
/** FMC_SR4_ILS ILS **/
#define FMC_SR4_ILS		(1 << 1)
/** FMC_SR4_IRS IRS **/
#define FMC_SR4_IRS		(1 << 0)

/**@}*/

/** @defgroup fmc_pmem4 PMEM4 Common memory space timing register 4
@{*/


#define FMC_PMEM4_MEMHIZx_SHIFT		24
#define FMC_PMEM4_MEMHIZx_MASK		0xff
/** @defgroup fmc_pmem4_memhizx MEMHIZx MEMHIZx
@{*/
/**@}*/


