grevaillot/svd_tools/headers/STM32F429/fmc.h
#define FMC_PMEM4_MEMHOLDx_SHIFT		16
#define FMC_PMEM4_MEMHOLDx_MASK		0xff
/** @defgroup fmc_pmem4_memholdx MEMHOLDx MEMHOLDx
@{*/
/**@}*/


#define FMC_PMEM4_MEMWAITx_SHIFT		8
#define FMC_PMEM4_MEMWAITx_MASK		0xff
/** @defgroup fmc_pmem4_memwaitx MEMWAITx MEMWAITx
@{*/
/**@}*/


#define FMC_PMEM4_MEMSETx_SHIFT		0
#define FMC_PMEM4_MEMSETx_MASK		0xff
/** @defgroup fmc_pmem4_memsetx MEMSETx MEMSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_patt4 PATT4 Attribute memory space timing register 4
@{*/


#define FMC_PATT4_ATTHIZx_SHIFT		24
#define FMC_PATT4_ATTHIZx_MASK		0xff
/** @defgroup fmc_patt4_atthizx ATTHIZx ATTHIZx
@{*/
/**@}*/


#define FMC_PATT4_ATTHOLDx_SHIFT		16
#define FMC_PATT4_ATTHOLDx_MASK		0xff
/** @defgroup fmc_patt4_attholdx ATTHOLDx ATTHOLDx
@{*/
/**@}*/


#define FMC_PATT4_ATTWAITx_SHIFT		8
#define FMC_PATT4_ATTWAITx_MASK		0xff
/** @defgroup fmc_patt4_attwaitx ATTWAITx ATTWAITx
@{*/
/**@}*/


#define FMC_PATT4_ATTSETx_SHIFT		0
#define FMC_PATT4_ATTSETx_MASK		0xff
/** @defgroup fmc_patt4_attsetx ATTSETx ATTSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_pio4 PIO4 I/O space timing register 4
@{*/


#define FMC_PIO4_IOHIZx_SHIFT		24
#define FMC_PIO4_IOHIZx_MASK		0xff
/** @defgroup fmc_pio4_iohizx IOHIZx IOHIZx
@{*/
/**@}*/


#define FMC_PIO4_IOHOLDx_SHIFT		16
#define FMC_PIO4_IOHOLDx_MASK		0xff
/** @defgroup fmc_pio4_ioholdx IOHOLDx IOHOLDx
@{*/
/**@}*/


#define FMC_PIO4_IOWAITx_SHIFT		8
#define FMC_PIO4_IOWAITx_MASK		0xff
/** @defgroup fmc_pio4_iowaitx IOWAITx IOWAITx
@{*/
/**@}*/


#define FMC_PIO4_IOSETx_SHIFT		0
#define FMC_PIO4_IOSETx_MASK		0xff
/** @defgroup fmc_pio4_iosetx IOSETx IOSETx
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bwtr1 BWTR1 SRAM/NOR-Flash write timing registers 1
@{*/


#define FMC_BWTR1_ACCMOD_SHIFT		28
#define FMC_BWTR1_ACCMOD_MASK		0x03
/** @defgroup fmc_bwtr1_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BWTR1_DATLAT_SHIFT		24
#define FMC_BWTR1_DATLAT_MASK		0x0f
/** @defgroup fmc_bwtr1_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BWTR1_CLKDIV_SHIFT		20
#define FMC_BWTR1_CLKDIV_MASK		0x0f
/** @defgroup fmc_bwtr1_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BWTR1_DATAST_SHIFT		8
#define FMC_BWTR1_DATAST_MASK		0xff
/** @defgroup fmc_bwtr1_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BWTR1_ADDHLD_SHIFT		4
#define FMC_BWTR1_ADDHLD_MASK		0x0f
/** @defgroup fmc_bwtr1_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BWTR1_ADDSET_SHIFT		0
#define FMC_BWTR1_ADDSET_MASK		0x0f
/** @defgroup fmc_bwtr1_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bwtr3 BWTR3 SRAM/NOR-Flash write timing registers 3
@{*/


#define FMC_BWTR3_ACCMOD_SHIFT		28
#define FMC_BWTR3_ACCMOD_MASK		0x03
/** @defgroup fmc_bwtr3_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BWTR3_DATLAT_SHIFT		24
#define FMC_BWTR3_DATLAT_MASK		0x0f
/** @defgroup fmc_bwtr3_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BWTR3_CLKDIV_SHIFT		20
#define FMC_BWTR3_CLKDIV_MASK		0x0f
/** @defgroup fmc_bwtr3_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BWTR3_DATAST_SHIFT		8
#define FMC_BWTR3_DATAST_MASK		0xff
/** @defgroup fmc_bwtr3_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BWTR3_ADDHLD_SHIFT		4
#define FMC_BWTR3_ADDHLD_MASK		0x0f
/** @defgroup fmc_bwtr3_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BWTR3_ADDSET_SHIFT		0
#define FMC_BWTR3_ADDSET_MASK		0x0f
/** @defgroup fmc_bwtr3_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bwtr2 BWTR2 SRAM/NOR-Flash write timing registers 2
@{*/


#define FMC_BWTR2_ACCMOD_SHIFT		28
#define FMC_BWTR2_ACCMOD_MASK		0x03
/** @defgroup fmc_bwtr2_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BWTR2_DATLAT_SHIFT		24
#define FMC_BWTR2_DATLAT_MASK		0x0f
/** @defgroup fmc_bwtr2_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BWTR2_CLKDIV_SHIFT		20
#define FMC_BWTR2_CLKDIV_MASK		0x0f
/** @defgroup fmc_bwtr2_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BWTR2_DATAST_SHIFT		8
#define FMC_BWTR2_DATAST_MASK		0xff
/** @defgroup fmc_bwtr2_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BWTR2_ADDHLD_SHIFT		4
#define FMC_BWTR2_ADDHLD_MASK		0x0f
/** @defgroup fmc_bwtr2_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BWTR2_ADDSET_SHIFT		0
#define FMC_BWTR2_ADDSET_MASK		0x0f
/** @defgroup fmc_bwtr2_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_bwtr4 BWTR4 SRAM/NOR-Flash write timing registers 4
@{*/


#define FMC_BWTR4_ACCMOD_SHIFT		28
#define FMC_BWTR4_ACCMOD_MASK		0x03
/** @defgroup fmc_bwtr4_accmod ACCMOD ACCMOD
@{*/
/**@}*/


#define FMC_BWTR4_DATLAT_SHIFT		24
#define FMC_BWTR4_DATLAT_MASK		0x0f
/** @defgroup fmc_bwtr4_datlat DATLAT DATLAT
@{*/
/**@}*/


#define FMC_BWTR4_CLKDIV_SHIFT		20
#define FMC_BWTR4_CLKDIV_MASK		0x0f
/** @defgroup fmc_bwtr4_clkdiv CLKDIV CLKDIV
@{*/
/**@}*/


#define FMC_BWTR4_DATAST_SHIFT		8
#define FMC_BWTR4_DATAST_MASK		0xff
/** @defgroup fmc_bwtr4_datast DATAST DATAST
@{*/
/**@}*/


#define FMC_BWTR4_ADDHLD_SHIFT		4
#define FMC_BWTR4_ADDHLD_MASK		0x0f
/** @defgroup fmc_bwtr4_addhld ADDHLD ADDHLD
@{*/
/**@}*/


#define FMC_BWTR4_ADDSET_SHIFT		0
#define FMC_BWTR4_ADDSET_MASK		0x0f
/** @defgroup fmc_bwtr4_addset ADDSET ADDSET
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_sdcr1 SDCR1 SDRAM Control Register 1
@{*/


#define FMC_SDCR1_RPIPE_SHIFT		13
#define FMC_SDCR1_RPIPE_MASK		0x03
/** @defgroup fmc_sdcr1_rpipe RPIPE Read pipe
@{*/
/**@}*/

/** FMC_SDCR1_RBURST Burst read **/
#define FMC_SDCR1_RBURST		(1 << 12)

#define FMC_SDCR1_SDCLK_SHIFT		10
#define FMC_SDCR1_SDCLK_MASK		0x03
/** @defgroup fmc_sdcr1_sdclk SDCLK SDRAM clock configuration
@{*/
/**@}*/

/** FMC_SDCR1_WP Write protection **/
#define FMC_SDCR1_WP		(1 << 9)

#define FMC_SDCR1_CAS_SHIFT		7
#define FMC_SDCR1_CAS_MASK		0x03
/** @defgroup fmc_sdcr1_cas CAS CAS latency
@{*/
/**@}*/

/** FMC_SDCR1_NB Number of internal banks **/
#define FMC_SDCR1_NB		(1 << 6)

#define FMC_SDCR1_MWID_SHIFT		4
#define FMC_SDCR1_MWID_MASK		0x03
/** @defgroup fmc_sdcr1_mwid MWID Memory data bus width
@{*/
/**@}*/


#define FMC_SDCR1_NR_SHIFT		2
#define FMC_SDCR1_NR_MASK		0x03
/** @defgroup fmc_sdcr1_nr NR Number of row address bits
@{*/
/**@}*/


#define FMC_SDCR1_NC_SHIFT		0
#define FMC_SDCR1_NC_MASK		0x03
/** @defgroup fmc_sdcr1_nc NC Number of column address bits
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_sdcr2 SDCR2 SDRAM Control Register 2
@{*/


#define FMC_SDCR2_RPIPE_SHIFT		13
#define FMC_SDCR2_RPIPE_MASK		0x03
/** @defgroup fmc_sdcr2_rpipe RPIPE Read pipe
@{*/
/**@}*/

/** FMC_SDCR2_RBURST Burst read **/
#define FMC_SDCR2_RBURST		(1 << 12)

#define FMC_SDCR2_SDCLK_SHIFT		10
#define FMC_SDCR2_SDCLK_MASK		0x03
/** @defgroup fmc_sdcr2_sdclk SDCLK SDRAM clock configuration
@{*/
/**@}*/

/** FMC_SDCR2_WP Write protection **/
#define FMC_SDCR2_WP		(1 << 9)

