grevaillot/svd_tools/headers/STM32F429/fmc.h
#define FMC_SDCR2_CAS_SHIFT		7
#define FMC_SDCR2_CAS_MASK		0x03
/** @defgroup fmc_sdcr2_cas CAS CAS latency
@{*/
/**@}*/

/** FMC_SDCR2_NB Number of internal banks **/
#define FMC_SDCR2_NB		(1 << 6)

#define FMC_SDCR2_MWID_SHIFT		4
#define FMC_SDCR2_MWID_MASK		0x03
/** @defgroup fmc_sdcr2_mwid MWID Memory data bus width
@{*/
/**@}*/


#define FMC_SDCR2_NR_SHIFT		2
#define FMC_SDCR2_NR_MASK		0x03
/** @defgroup fmc_sdcr2_nr NR Number of row address bits
@{*/
/**@}*/


#define FMC_SDCR2_NC_SHIFT		0
#define FMC_SDCR2_NC_MASK		0x03
/** @defgroup fmc_sdcr2_nc NC Number of column address bits
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_sdtr1 SDTR1 SDRAM Timing register 1
@{*/


#define FMC_SDTR1_TRCD_SHIFT		24
#define FMC_SDTR1_TRCD_MASK		0x0f
/** @defgroup fmc_sdtr1_trcd TRCD Row to column delay
@{*/
/**@}*/


#define FMC_SDTR1_TRP_SHIFT		20
#define FMC_SDTR1_TRP_MASK		0x0f
/** @defgroup fmc_sdtr1_trp TRP Row precharge delay
@{*/
/**@}*/


#define FMC_SDTR1_TWR_SHIFT		16
#define FMC_SDTR1_TWR_MASK		0x0f
/** @defgroup fmc_sdtr1_twr TWR Recovery delay
@{*/
/**@}*/


#define FMC_SDTR1_TRC_SHIFT		12
#define FMC_SDTR1_TRC_MASK		0x0f
/** @defgroup fmc_sdtr1_trc TRC Row cycle delay
@{*/
/**@}*/


#define FMC_SDTR1_TRAS_SHIFT		8
#define FMC_SDTR1_TRAS_MASK		0x0f
/** @defgroup fmc_sdtr1_tras TRAS Self refresh time
@{*/
/**@}*/


#define FMC_SDTR1_TXSR_SHIFT		4
#define FMC_SDTR1_TXSR_MASK		0x0f
/** @defgroup fmc_sdtr1_txsr TXSR Exit self-refresh delay
@{*/
/**@}*/


#define FMC_SDTR1_TMRD_SHIFT		0
#define FMC_SDTR1_TMRD_MASK		0x0f
/** @defgroup fmc_sdtr1_tmrd TMRD Load Mode Register to Active
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_sdtr2 SDTR2 SDRAM Timing register 2
@{*/


#define FMC_SDTR2_TRCD_SHIFT		24
#define FMC_SDTR2_TRCD_MASK		0x0f
/** @defgroup fmc_sdtr2_trcd TRCD Row to column delay
@{*/
/**@}*/


#define FMC_SDTR2_TRP_SHIFT		20
#define FMC_SDTR2_TRP_MASK		0x0f
/** @defgroup fmc_sdtr2_trp TRP Row precharge delay
@{*/
/**@}*/


#define FMC_SDTR2_TWR_SHIFT		16
#define FMC_SDTR2_TWR_MASK		0x0f
/** @defgroup fmc_sdtr2_twr TWR Recovery delay
@{*/
/**@}*/


#define FMC_SDTR2_TRC_SHIFT		12
#define FMC_SDTR2_TRC_MASK		0x0f
/** @defgroup fmc_sdtr2_trc TRC Row cycle delay
@{*/
/**@}*/


#define FMC_SDTR2_TRAS_SHIFT		8
#define FMC_SDTR2_TRAS_MASK		0x0f
/** @defgroup fmc_sdtr2_tras TRAS Self refresh time
@{*/
/**@}*/


#define FMC_SDTR2_TXSR_SHIFT		4
#define FMC_SDTR2_TXSR_MASK		0x0f
/** @defgroup fmc_sdtr2_txsr TXSR Exit self-refresh delay
@{*/
/**@}*/


#define FMC_SDTR2_TMRD_SHIFT		0
#define FMC_SDTR2_TMRD_MASK		0x0f
/** @defgroup fmc_sdtr2_tmrd TMRD Load Mode Register to Active
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_sdcmr SDCMR SDRAM Command Mode register
@{*/


#define FMC_SDCMR_MRD_SHIFT		9
#define FMC_SDCMR_MRD_MASK		0x1fff
/** @defgroup fmc_sdcmr_mrd MRD Mode Register definition
@{*/
/**@}*/


#define FMC_SDCMR_NRFS_SHIFT		5
#define FMC_SDCMR_NRFS_MASK		0x0f
/** @defgroup fmc_sdcmr_nrfs NRFS Number of Auto-refresh
@{*/
/**@}*/

/** FMC_SDCMR_CTB1 Command target bank 1 **/
#define FMC_SDCMR_CTB1		(1 << 4)
/** FMC_SDCMR_CTB2 Command target bank 2 **/
#define FMC_SDCMR_CTB2		(1 << 3)

#define FMC_SDCMR_MODE_SHIFT		0
#define FMC_SDCMR_MODE_MASK		0x07
/** @defgroup fmc_sdcmr_mode MODE Command mode
@{*/
/**@}*/


/**@}*/

/** @defgroup fmc_sdrtr SDRTR SDRAM Refresh Timer register
@{*/

/** FMC_SDRTR_REIE RES Interrupt Enable **/
#define FMC_SDRTR_REIE		(1 << 14)

#define FMC_SDRTR_COUNT_SHIFT		1
#define FMC_SDRTR_COUNT_MASK		0x1fff
/** @defgroup fmc_sdrtr_count COUNT Refresh Timer Count
@{*/
/**@}*/

/** FMC_SDRTR_CRE Clear Refresh error flag **/
#define FMC_SDRTR_CRE		(1 << 0)

/**@}*/

/** @defgroup fmc_sdsr SDSR SDRAM Status register
@{*/

/** FMC_SDSR_BUSY Busy status **/
#define FMC_SDSR_BUSY		(1 << 5)

#define FMC_SDSR_MODES2_SHIFT		3
#define FMC_SDSR_MODES2_MASK		0x03
/** @defgroup fmc_sdsr_modes2 MODES2 Status Mode for Bank 2
@{*/
/**@}*/


#define FMC_SDSR_MODES1_SHIFT		1
#define FMC_SDSR_MODES1_MASK		0x03
/** @defgroup fmc_sdsr_modes1 MODES1 Status Mode for Bank 1
@{*/
/**@}*/

/** FMC_SDSR_RE Refresh error flag **/
#define FMC_SDSR_RE		(1 << 0)

/**@}*/
